/*
	@file	StageItem.cpp
	@brief	ステージアイテムクラス
*/
#include "pch.h"
#include "Game/Objects/Stage/Item/StageItem.h"
#include "Game/Collider/SphereCollider.h"

//-------------------------------------------------------------------
// コンストラクタ
//-------------------------------------------------------------------
StageItem::StageItem()
{
}

//-------------------------------------------------------------------
// 初期化処理
//-------------------------------------------------------------------
void StageItem::Initialize(DirectX::SimpleMath::Vector3 position)
{
	// ステージアイテムの生成
	m_collider = std::make_unique<SphereCollider>();
	m_collider->CreateBoundingSphere(position, 1.0f);
}

//-------------------------------------------------------------------
// 更新処理
//-------------------------------------------------------------------
void StageItem::Update()
{
}

//-------------------------------------------------------------------
// 描画処理
//-------------------------------------------------------------------
void StageItem::Render()
{
}
