/*
	@file	ProgressionManager.h
	@brief	ゲームの進行管理クラス
*/
#include "pch.h"
#include "ProgressionManager.h"
#include "Message/Messenger.h"

//-------------------------------------------------------------------
// コンストラクタ
//-------------------------------------------------------------------
ProgressionManager::ProgressionManager()
	:
	m_tanks{}
{
}

//-------------------------------------------------------------------
// デストラクタ
//-------------------------------------------------------------------
ProgressionManager::~ProgressionManager()
{
}

//-------------------------------------------------------------------
// 初期化処理
//-------------------------------------------------------------------
void ProgressionManager::Initialize(std::vector<Tank*> tanks)
{
	// 全戦車情報の設定
	m_tanks = tanks;

	// メッセンジャーの取得
	//m_messenger = Messenger::GetInstance();
}

//-------------------------------------------------------------------
// 更新処理
//-------------------------------------------------------------------
void ProgressionManager::Update()
{
}
